; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	image4 - mode
	spectrograph0 - mode
	image5 - mode
	infrared2 - mode
	infrared3 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	GroundStation11 - direction
	Star12 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	Star5 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 thermograph1)
	(supports instrument0 infrared3)
	(supports instrument0 image5)
	(supports instrument0 spectrograph0)
	(supports instrument0 image4)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Planet13 thermograph1)
	(have_image Planet13 image5)
	(have_image Phenomenon14 image5)
	(have_image Phenomenon14 infrared2)
	(have_image Phenomenon15 image5)
	(have_image Phenomenon15 spectrograph0)
	(have_image Phenomenon16 image5)
	(have_image Phenomenon16 infrared2)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
2. (turn_to satellite0 phenomenon14 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 8
3. (turn_to satellite0 star5 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star5)
   goals met: 0 of 8
4. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 8
5. (turn_to satellite0 phenomenon14 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon14)
   goals met: 0 of 8
6. (take_image satellite0 phenomenon14 instrument0 image5)
   added: (have_image phenomenon14 image5)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon14 instrument0 infrared2)
   added: (have_image phenomenon14 infrared2)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon15 instrument0 image5)
   added: (have_image phenomenon15 image5)
   goals met: 3 of 8
10. (take_image satellite0 phenomenon15 instrument0 spectrograph0)
   added: (have_image phenomenon15 spectrograph0)
   goals met: 4 of 8
11. (turn_to satellite0 phenomenon16 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 8
12. (take_image satellite0 phenomenon16 instrument0 image5)
   added: (have_image phenomenon16 image5)
   goals met: 5 of 8
13. (take_image satellite0 phenomenon16 instrument0 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 6 of 8
14. (turn_to satellite0 planet13 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 planet13)
   goals met: 6 of 8
15. (take_image satellite0 planet13 instrument0 image5)
   added: (have_image planet13 image5)
   goals met: 7 of 8
16. (take_image satellite0 planet13 instrument0 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 8 of 8
